import { 关系阶段冷淡, 关系阶段疏远, 关系阶段认识, 关系阶段熟悉, 关系阶段朋友, 关系阶段好友, 关系阶段暧昧, 关系阶段心动, 关系阶段热恋, 关系阶段深爱 } from '../术语/统计';

export type 统计枚举键清单 = {
  关系阶段冷淡: string;
  关系阶段疏远: string;
  关系阶段认识: string;
  关系阶段熟悉: string;
  关系阶段朋友: string;
  关系阶段好友: string;
  关系阶段暧昧: string;
  关系阶段心动: string;
  关系阶段热恋: string;
  关系阶段深爱: string;
};

export const 统计枚举文案 = {
  关系阶段冷淡: 关系阶段冷淡,
  关系阶段疏远: 关系阶段疏远,
  关系阶段认识: 关系阶段认识,
  关系阶段熟悉: 关系阶段熟悉,
  关系阶段朋友: 关系阶段朋友,
  关系阶段好友: 关系阶段好友,
  关系阶段暧昧: 关系阶段暧昧,
  关系阶段心动: 关系阶段心动,
  关系阶段热恋: 关系阶段热恋,
  关系阶段深爱: 关系阶段深爱,
} as const satisfies 统计枚举键清单;
